app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
	def show
		@user = User.find(params[:id])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt") VALUES ('ritika bose', 'r3majumdar@yahoo.com', '2011-11-04 19:56:15.500000', '2011-11-04 19:56:15.500000', '151bcee7ce5263035e5f9b0d7f123309e68107e082632e95de5f7f87952f01de', 'ca0961be4f009b08586f511a882b6768e80112ce0dd0f4f979df371711a291d2')
---
    def create
    	@user = User.new(params[:user])
    	if @user.save